# პირველი დავალება

x=int(input("შეიყვანე პირველი რიცხვი: "))
y=int(input("შეიყვანე მეორე რიცხვი: "))
z=int(input("შეიყვანე მესამე რიცხვი: "))
total=x+y+z
print("მოცემული რიცხვების ჯამია ",total)


#მეორე დავალება

i=int(input("დაწერეთ კუბის გვერდის სიგრძე: "))
v=i**3
s=i*i
print("კუბის მოცულობაა ",v,",", "ხოლო ზედაპირის ფართობია ", s)


#მესამე დავალება

m=float(input("მონიტორის ფასი: "))
sb=float(input("სისტემური ბლოკის ფასი: "))
kbrd=float(input("კლავიატურის ფასი: "))
ms=float(input("მაუსის ფასი: "))
total_c=m+sb+kbrd+ms
print("კომპიუტერის სრული ფასია: ",total_c)
